zephyrproject-rtos/hal_nxp/dts/nxp/lpc/lpc55xxx/pinctrl/LPC5536JBD64-pinctrl.h
/*
 * NOTE: File generated by gen_soc_headers.py
 * from LPC5536JBD64/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on LPC55S36JBD100-pinctrl.h with this part's differences applied
 * below (2626 removed, 2 changed,
 * 2 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: a29f6de5ce1b936c
 */

#ifndef _ZEPHYR_DTS_BINDING_LPC5536JBD64_WRAPPER_
#define _ZEPHYR_DTS_BINDING_LPC5536JBD64_WRAPPER_

#include "LPC55S36JBD100-pinctrl.h"

/* Signals not present on this part */
#undef ADC0_CH0A_PIO1_9
#undef ADC0_CH4B_PIO1_19
#undef ADC0_CH8B_PIO0_23
#undef ADC0_CH9A_PIO2_0
#undef ADC0_TRIG0_PIO0_12
#undef ADC0_TRIG0_PIO0_23
#undef ADC0_TRIG0_PIO0_28
#undef ADC0_TRIG0_PIO1_10
#undef ADC0_TRIG0_PIO1_12
#undef ADC0_TRIG0_PIO1_14
#undef ADC0_TRIG0_PIO1_17
#undef ADC0_TRIG0_PIO1_18
#undef ADC0_TRIG0_PIO1_19
#undef ADC0_TRIG0_PIO1_20
#undef ADC0_TRIG0_PIO1_21
#undef ADC0_TRIG0_PIO1_23
#undef ADC0_TRIG0_PIO1_24
#undef ADC0_TRIG0_PIO1_25
#undef ADC0_TRIG0_PIO1_26
#undef ADC0_TRIG0_PIO1_27
#undef ADC0_TRIG0_PIO1_28
#undef ADC0_TRIG0_PIO1_29
#undef ADC0_TRIG0_PIO1_30
#undef ADC0_TRIG0_PIO1_31
#undef ADC0_TRIG0_PIO1_4
#undef ADC0_TRIG0_PIO1_5
#undef ADC0_TRIG0_PIO1_6
#undef ADC0_TRIG0_PIO1_7
#undef ADC0_TRIG0_PIO1_8
#undef ADC0_TRIG0_PIO1_9
#undef ADC0_TRIG1_PIO0_12
#undef ADC0_TRIG1_PIO0_23
#undef ADC0_TRIG1_PIO0_28
#undef ADC0_TRIG1_PIO1_10
#undef ADC0_TRIG1_PIO1_12
#undef ADC0_TRIG1_PIO1_14
#undef ADC0_TRIG1_PIO1_17
#undef ADC0_TRIG1_PIO1_18
#undef ADC0_TRIG1_PIO1_19
#undef ADC0_TRIG1_PIO1_20
#undef ADC0_TRIG1_PIO1_21
#undef ADC0_TRIG1_PIO1_23
#undef ADC0_TRIG1_PIO1_24
#undef ADC0_TRIG1_PIO1_25
#undef ADC0_TRIG1_PIO1_26
#undef ADC0_TRIG1_PIO1_27
#undef ADC0_TRIG1_PIO1_28
#undef ADC0_TRIG1_PIO1_29
#undef ADC0_TRIG1_PIO1_30
#undef ADC0_TRIG1_PIO1_31
#undef ADC0_TRIG1_PIO1_4
#undef ADC0_TRIG1_PIO1_5
#undef ADC0_TRIG1_PIO1_6
#undef ADC0_TRIG1_PIO1_7
#undef ADC0_TRIG1_PIO1_8
#undef ADC0_TRIG1_PIO1_9
#undef ADC0_TRIG2_PIO0_12
#undef ADC0_TRIG2_PIO0_23
#undef ADC0_TRIG2_PIO0_28
#undef ADC0_TRIG2_PIO1_10
#undef ADC0_TRIG2_PIO1_12
#undef ADC0_TRIG2_PIO1_14
#undef ADC0_TRIG2_PIO1_17
#undef ADC0_TRIG2_PIO1_18
#undef ADC0_TRIG2_PIO1_19
#undef ADC0_TRIG2_PIO1_20
#undef ADC0_TRIG2_PIO1_21
#undef ADC0_TRIG2_PIO1_23
#undef ADC0_TRIG2_PIO1_24
#undef ADC0_TRIG2_PIO1_25
#undef ADC0_TRIG2_PIO1_26
#undef ADC0_TRIG2_PIO1_27
#undef ADC0_TRIG2_PIO1_28
#undef ADC0_TRIG2_PIO1_29
#undef ADC0_TRIG2_PIO1_30
#undef ADC0_TRIG2_PIO1_31
#undef ADC0_TRIG2_PIO1_4
#undef ADC0_TRIG2_PIO1_5
#undef ADC0_TRIG2_PIO1_6
#undef ADC0_TRIG2_PIO1_7
#undef ADC0_TRIG2_PIO1_8
#undef ADC0_TRIG2_PIO1_9
#undef ADC0_TRIG3_PIO0_12
#undef ADC0_TRIG3_PIO0_23
#undef ADC0_TRIG3_PIO0_28
#undef ADC0_TRIG3_PIO1_10
#undef ADC0_TRIG3_PIO1_12
#undef ADC0_TRIG3_PIO1_14
#undef ADC0_TRIG3_PIO1_17
#undef ADC0_TRIG3_PIO1_18
#undef ADC0_TRIG3_PIO1_19
#undef ADC0_TRIG3_PIO1_20
#undef ADC0_TRIG3_PIO1_21
#undef ADC0_TRIG3_PIO1_23
#undef ADC0_TRIG3_PIO1_24
#undef ADC0_TRIG3_PIO1_25
#undef ADC0_TRIG3_PIO1_26
#undef ADC0_TRIG3_PIO1_27
#undef ADC0_TRIG3_PIO1_28
#undef ADC0_TRIG3_PIO1_29
#undef ADC0_TRIG3_PIO1_30
#undef ADC0_TRIG3_PIO1_31
#undef ADC0_TRIG3_PIO1_4
#undef ADC0_TRIG3_PIO1_5
#undef ADC0_TRIG3_PIO1_6
#undef ADC0_TRIG3_PIO1_7
#undef ADC0_TRIG3_PIO1_8
#undef ADC0_TRIG3_PIO1_9
#undef ADC1_CH3A_PIO0_12
#undef ADC1_CH3B_PIO1_7
#undef ADC1_CH8A_PIO1_20
#undef ADC1_CH8B_PIO1_24
#undef ADC1_TRIG0_PIO0_12
#undef ADC1_TRIG0_PIO0_23
#undef ADC1_TRIG0_PIO0_28
#undef ADC1_TRIG0_PIO1_10
#undef ADC1_TRIG0_PIO1_12
#undef ADC1_TRIG0_PIO1_14
#undef ADC1_TRIG0_PIO1_17
#undef ADC1_TRIG0_PIO1_18
#undef ADC1_TRIG0_PIO1_19
#undef ADC1_TRIG0_PIO1_20
#undef ADC1_TRIG0_PIO1_21
#undef ADC1_TRIG0_PIO1_23
#undef ADC1_TRIG0_PIO1_24
#undef ADC1_TRIG0_PIO1_25
#undef ADC1_TRIG0_PIO1_26
#undef ADC1_TRIG0_PIO1_27
#undef ADC1_TRIG0_PIO1_28
#undef ADC1_TRIG0_PIO1_29
#undef ADC1_TRIG0_PIO1_30
#undef ADC1_TRIG0_PIO1_31
#undef ADC1_TRIG0_PIO1_4
#undef ADC1_TRIG0_PIO1_5
#undef ADC1_TRIG0_PIO1_6
#undef ADC1_TRIG0_PIO1_7
#undef ADC1_TRIG0_PIO1_8
#undef ADC1_TRIG0_PIO1_9
#undef ADC1_TRIG1_PIO0_12
#undef ADC1_TRIG1_PIO0_23
#undef ADC1_TRIG1_PIO0_28
#undef ADC1_TRIG1_PIO1_10
#undef ADC1_TRIG1_PIO1_12
#undef ADC1_TRIG1_PIO1_14
#undef ADC1_TRIG1_PIO1_17
#undef ADC1_TRIG1_PIO1_18
#undef ADC1_TRIG1_PIO1_19
#undef ADC1_TRIG1_PIO1_20
#undef ADC1_TRIG1_PIO1_21
#undef ADC1_TRIG1_PIO1_23
#undef ADC1_TRIG1_PIO1_24
#undef ADC1_TRIG1_PIO1_25
#undef ADC1_TRIG1_PIO1_26
#undef ADC1_TRIG1_PIO1_27
#undef ADC1_TRIG1_PIO1_28
#undef ADC1_TRIG1_PIO1_29
#undef ADC1_TRIG1_PIO1_30
#undef ADC1_TRIG1_PIO1_31
#undef ADC1_TRIG1_PIO1_4
#undef ADC1_TRIG1_PIO1_5
#undef ADC1_TRIG1_PIO1_6
#undef ADC1_TRIG1_PIO1_7
#undef ADC1_TRIG1_PIO1_8
#undef ADC1_TRIG1_PIO1_9
#undef ADC1_TRIG2_PIO0_12
#undef ADC1_TRIG2_PIO0_23
#undef ADC1_TRIG2_PIO0_28
#undef ADC1_TRIG2_PIO1_10
#undef ADC1_TRIG2_PIO1_12
#undef ADC1_TRIG2_PIO1_14
#undef ADC1_TRIG2_PIO1_17
#undef ADC1_TRIG2_PIO1_18
#undef ADC1_TRIG2_PIO1_19
#undef ADC1_TRIG2_PIO1_20
#undef ADC1_TRIG2_PIO1_21
#undef ADC1_TRIG2_PIO1_23
#undef ADC1_TRIG2_PIO1_24
#undef ADC1_TRIG2_PIO1_25
#undef ADC1_TRIG2_PIO1_26
#undef ADC1_TRIG2_PIO1_27
#undef ADC1_TRIG2_PIO1_28
#undef ADC1_TRIG2_PIO1_29
#undef ADC1_TRIG2_PIO1_30
#undef ADC1_TRIG2_PIO1_31
#undef ADC1_TRIG2_PIO1_4
#undef ADC1_TRIG2_PIO1_5
#undef ADC1_TRIG2_PIO1_6
#undef ADC1_TRIG2_PIO1_7
#undef ADC1_TRIG2_PIO1_8
#undef ADC1_TRIG2_PIO1_9
#undef ADC1_TRIG3_PIO0_12
#undef ADC1_TRIG3_PIO0_23
#undef ADC1_TRIG3_PIO0_28
#undef ADC1_TRIG3_PIO1_10
#undef ADC1_TRIG3_PIO1_12
#undef ADC1_TRIG3_PIO1_14
#undef ADC1_TRIG3_PIO1_17
#undef ADC1_TRIG3_PIO1_18
#undef ADC1_TRIG3_PIO1_19
#undef ADC1_TRIG3_PIO1_20
#undef ADC1_TRIG3_PIO1_21
#undef ADC1_TRIG3_PIO1_23
#undef ADC1_TRIG3_PIO1_24
#undef ADC1_TRIG3_PIO1_25
#undef ADC1_TRIG3_PIO1_26
#undef ADC1_TRIG3_PIO1_27
#undef ADC1_TRIG3_PIO1_28
#undef ADC1_TRIG3_PIO1_29
#undef ADC1_TRIG3_PIO1_30
#undef ADC1_TRIG3_PIO1_31
#undef ADC1_TRIG3_PIO1_4
#undef ADC1_TRIG3_PIO1_5
#undef ADC1_TRIG3_PIO1_6
#undef ADC1_TRIG3_PIO1_7
#undef ADC1_TRIG3_PIO1_8
#undef ADC1_TRIG3_PIO1_9
#undef AOI0_IN0_PIO1_31
#undef AOI0_IN10_PIO1_31
#undef AOI0_IN11_PIO1_31
#undef AOI0_IN12_PIO1_31
#undef AOI0_IN13_PIO1_31
#undef AOI0_IN14_PIO1_31
#undef AOI0_IN15_PIO1_31
#undef AOI0_IN1_PIO1_31
#undef AOI0_IN2_PIO1_31
#undef AOI0_IN3_PIO1_31
#undef AOI0_IN4_PIO1_31
#undef AOI0_IN5_PIO1_31
#undef AOI0_IN6_PIO1_31
#undef AOI0_IN7_PIO1_31
#undef AOI0_IN8_PIO1_31
#undef AOI0_IN9_PIO1_31
#undef AOI0_OUT0_PIO2_0
#undef AOI0_OUT1_PIO1_12
#undef AOI0_OUT1_PIO1_20
#undef AOI0_OUT2_PIO1_24
#undef AOI0_OUT3_PIO1_25
#undef AOI0_TRIGOUT0_PIO1_5
#undef AOI0_TRIGOUT1_PIO1_21
#undef AOI0_TRIGOUT3_PIO1_10
#undef AOI0_TRIGOUT4_PIO1_23
#undef AOI0_TRIGOUT4_PIO1_28
#undef AOI0_TRIGOUT5_PIO1_6
#undef AOI0_TRIGOUT6_PIO1_8
#undef AOI0_TRIGOUT7_PIO1_4
#undef AOI1_IN0_PIO1_31
#undef AOI1_IN10_PIO1_31
#undef AOI1_IN11_PIO1_31
#undef AOI1_IN12_PIO1_31
#undef AOI1_IN13_PIO1_31
#undef AOI1_IN14_PIO1_31
#undef AOI1_IN15_PIO1_31
#undef AOI1_IN1_PIO1_31
#undef AOI1_IN2_PIO1_31
#undef AOI1_IN3_PIO1_31
#undef AOI1_IN4_PIO1_31
#undef AOI1_IN5_PIO1_31
#undef AOI1_IN6_PIO1_31
#undef AOI1_IN7_PIO1_31
#undef AOI1_IN8_PIO1_31
#undef AOI1_IN9_PIO1_31
#undef AOI1_OUT1_PIO0_12
#undef AOI1_OUT2_PIO1_19
#undef AOI1_OUT2_PIO1_26
#undef AOI1_OUT2_PIO1_8
#undef AOI1_OUT3_PIO1_17
#undef AOI1_OUT3_PIO1_30
#undef AOI1_OUT3_PIO1_7
#undef AOI1_OUT3_PIO1_9
#undef AOI1_TRIGOUT0_PIO1_5
#undef AOI1_TRIGOUT1_PIO1_21
#undef AOI1_TRIGOUT3_PIO1_10
#undef AOI1_TRIGOUT4_PIO1_23
#undef AOI1_TRIGOUT4_PIO1_28
#undef AOI1_TRIGOUT5_PIO1_6
#undef AOI1_TRIGOUT6_PIO1_8
#undef AOI1_TRIGOUT7_PIO1_4
#undef CAN0_TD_PIO1_27
#undef CLKOUT_PIO1_27
#undef CTIMER0_CAPTURE0_PIO0_28
#undef CTIMER0_CAPTURE0_PIO1_20
#undef CTIMER0_CAPTURE0_PIO1_26
#undef CTIMER0_CAPTURE0_PIO1_28
#undef CTIMER0_CAPTURE0_PIO1_9
#undef CTIMER0_CAPTURE0_PIO2_0
#undef CTIMER0_CAPTURE1_PIO0_28
#undef CTIMER0_CAPTURE1_PIO1_20
#undef CTIMER0_CAPTURE1_PIO1_26
#undef CTIMER0_CAPTURE1_PIO1_28
#undef CTIMER0_CAPTURE1_PIO1_9
#undef CTIMER0_CAPTURE1_PIO2_0
#undef CTIMER0_CAPTURE2_PIO0_28
#undef CTIMER0_CAPTURE2_PIO1_20
#undef CTIMER0_CAPTURE2_PIO1_26
#undef CTIMER0_CAPTURE2_PIO1_28
#undef CTIMER0_CAPTURE2_PIO1_9
#undef CTIMER0_CAPTURE2_PIO2_0
#undef CTIMER0_CAPTURE3_PIO0_28
#undef CTIMER0_CAPTURE3_PIO1_20
#undef CTIMER0_CAPTURE3_PIO1_26
#undef CTIMER0_CAPTURE3_PIO1_28
#undef CTIMER0_CAPTURE3_PIO1_9
#undef CTIMER0_CAPTURE3_PIO2_0
#undef CTIMER0_MATCH2_PIO1_31
#undef CTIMER0_MATCH3_PIO1_27
#undef CTIMER1_CAPTURE0_PIO0_28
#undef CTIMER1_CAPTURE0_PIO1_20
#undef CTIMER1_CAPTURE0_PIO1_26
#undef CTIMER1_CAPTURE0_PIO1_28
#undef CTIMER1_CAPTURE0_PIO1_9
#undef CTIMER1_CAPTURE0_PIO2_0
#undef CTIMER1_CAPTURE1_PIO0_28
#undef CTIMER1_CAPTURE1_PIO1_20
#undef CTIMER1_CAPTURE1_PIO1_26
#undef CTIMER1_CAPTURE1_PIO1_28
#undef CTIMER1_CAPTURE1_PIO1_9
#undef CTIMER1_CAPTURE1_PIO2_0
#undef CTIMER1_CAPTURE2_PIO0_28
#undef CTIMER1_CAPTURE2_PIO1_20
#undef CTIMER1_CAPTURE2_PIO1_26
#undef CTIMER1_CAPTURE2_PIO1_28
#undef CTIMER1_CAPTURE2_PIO1_9
#undef CTIMER1_CAPTURE2_PIO2_0
#undef CTIMER1_CAPTURE3_PIO0_28
#undef CTIMER1_CAPTURE3_PIO1_20
#undef CTIMER1_CAPTURE3_PIO1_26
#undef CTIMER1_CAPTURE3_PIO1_28
#undef CTIMER1_CAPTURE3_PIO1_9
#undef CTIMER1_CAPTURE3_PIO2_0
#undef CTIMER1_MATCH0_PIO1_10
#undef CTIMER1_MATCH1_PIO1_12
#undef CTIMER1_MATCH2_PIO0_23
#undef CTIMER1_MATCH2_PIO1_14
#undef CTIMER2_CAPTURE0_PIO0_28
#undef CTIMER2_CAPTURE0_PIO1_20
#undef CTIMER2_CAPTURE0_PIO1_26
#undef CTIMER2_CAPTURE0_PIO1_28
#undef CTIMER2_CAPTURE0_PIO1_9
#undef CTIMER2_CAPTURE0_PIO2_0
#undef CTIMER2_CAPTURE1_PIO0_28
#undef CTIMER2_CAPTURE1_PIO1_20
#undef CTIMER2_CAPTURE1_PIO1_26
#undef CTIMER2_CAPTURE1_PIO1_28
#undef CTIMER2_CAPTURE1_PIO1_9
#undef CTIMER2_CAPTURE1_PIO2_0
#undef CTIMER2_CAPTURE2_PIO0_28
#undef CTIMER2_CAPTURE2_PIO1_20
#undef CTIMER2_CAPTURE2_PIO1_26
#undef CTIMER2_CAPTURE2_PIO1_28
#undef CTIMER2_CAPTURE2_PIO1_9
#undef CTIMER2_CAPTURE2_PIO2_0
#undef CTIMER2_CAPTURE3_PIO0_28
#undef CTIMER2_CAPTURE3_PIO1_20
#undef CTIMER2_CAPTURE3_PIO1_26
#undef CTIMER2_CAPTURE3_PIO1_28
#undef CTIMER2_CAPTURE3_PIO1_9
#undef CTIMER2_CAPTURE3_PIO2_0
#undef CTIMER2_MATCH0_PIO1_5
#undef CTIMER2_MATCH1_PIO1_4
#undef CTIMER2_MATCH1_PIO1_6
#undef CTIMER2_MATCH2_PIO1_7
#undef CTIMER3_CAPTURE0_PIO0_28
#undef CTIMER3_CAPTURE0_PIO1_20
#undef CTIMER3_CAPTURE0_PIO1_26
#undef CTIMER3_CAPTURE0_PIO1_28
#undef CTIMER3_CAPTURE0_PIO1_9
#undef CTIMER3_CAPTURE0_PIO2_0
#undef CTIMER3_CAPTURE1_PIO0_28
#undef CTIMER3_CAPTURE1_PIO1_20
#undef CTIMER3_CAPTURE1_PIO1_26
#undef CTIMER3_CAPTURE1_PIO1_28
#undef CTIMER3_CAPTURE1_PIO1_9
#undef CTIMER3_CAPTURE1_PIO2_0
#undef CTIMER3_CAPTURE2_PIO0_28
#undef CTIMER3_CAPTURE2_PIO1_20
#undef CTIMER3_CAPTURE2_PIO1_26
#undef CTIMER3_CAPTURE2_PIO1_28
#undef CTIMER3_CAPTURE2_PIO1_9
#undef CTIMER3_CAPTURE2_PIO2_0
#undef CTIMER3_CAPTURE3_PIO0_28
#undef CTIMER3_CAPTURE3_PIO1_20
#undef CTIMER3_CAPTURE3_PIO1_26
#undef CTIMER3_CAPTURE3_PIO1_28
#undef CTIMER3_CAPTURE3_PIO1_9
#undef CTIMER3_CAPTURE3_PIO2_0
#undef CTIMER3_MATCH1_PIO1_19
#undef CTIMER3_MATCH2_PIO1_21
#undef CTIMER3_MATCH3_PIO0_23
#undef CTIMER4_CAPTURE0_PIO0_28
#undef CTIMER4_CAPTURE0_PIO1_20
#undef CTIMER4_CAPTURE0_PIO1_26
#undef CTIMER4_CAPTURE0_PIO1_28
#undef CTIMER4_CAPTURE0_PIO1_9
#undef CTIMER4_CAPTURE0_PIO2_0
#undef CTIMER4_CAPTURE1_PIO0_28
#undef CTIMER4_CAPTURE1_PIO1_20
#undef CTIMER4_CAPTURE1_PIO1_26
#undef CTIMER4_CAPTURE1_PIO1_28
#undef CTIMER4_CAPTURE1_PIO1_9
#undef CTIMER4_CAPTURE1_PIO2_0
#undef CTIMER4_CAPTURE2_PIO0_28
#undef CTIMER4_CAPTURE2_PIO1_20
#undef CTIMER4_CAPTURE2_PIO1_26
#undef CTIMER4_CAPTURE2_PIO1_28
#undef CTIMER4_CAPTURE2_PIO1_9
#undef CTIMER4_CAPTURE2_PIO2_0
#undef CTIMER4_CAPTURE3_PIO0_28
#undef CTIMER4_CAPTURE3_PIO1_20
#undef CTIMER4_CAPTURE3_PIO1_26
#undef CTIMER4_CAPTURE3_PIO1_28
#undef CTIMER4_CAPTURE3_PIO1_9
#undef CTIMER4_CAPTURE3_PIO2_0
#undef CT_INP11_PIO0_28
#undef CT_INP14_PIO1_20
#undef CT_INP2_PIO1_28
#undef CT_INP3_PIO1_26
#undef CT_INP4_PIO1_9
#undef CT_INP4_PIO2_0
#undef DAC1_OUT_PIO1_19
#undef DMA0_TRIG00_PIO0_12
#undef DMA0_TRIG00_PIO0_23
#undef DMA0_TRIG00_PIO0_28
#undef DMA0_TRIG00_PIO1_10
#undef DMA0_TRIG00_PIO1_12
#undef DMA0_TRIG00_PIO1_14
#undef DMA0_TRIG00_PIO1_17
#undef DMA0_TRIG00_PIO1_18
#undef DMA0_TRIG00_PIO1_19
#undef DMA0_TRIG00_PIO1_20
#undef DMA0_TRIG00_PIO1_21
#undef DMA0_TRIG00_PIO1_23
#undef DMA0_TRIG00_PIO1_24
#undef DMA0_TRIG00_PIO1_25
#undef DMA0_TRIG00_PIO1_26
#undef DMA0_TRIG00_PIO1_27
#undef DMA0_TRIG00_PIO1_28
#undef DMA0_TRIG00_PIO1_29
#undef DMA0_TRIG00_PIO1_30
#undef DMA0_TRIG00_PIO1_31
#undef DMA0_TRIG00_PIO1_4
#undef DMA0_TRIG00_PIO1_5
#undef DMA0_TRIG00_PIO1_6
#undef DMA0_TRIG00_PIO1_7
#undef DMA0_TRIG00_PIO1_8
#undef DMA0_TRIG00_PIO1_9
#undef DMA0_TRIG010_PIO0_12
#undef DMA0_TRIG010_PIO0_23
#undef DMA0_TRIG010_PIO0_28
#undef DMA0_TRIG010_PIO1_10
#undef DMA0_TRIG010_PIO1_12
#undef DMA0_TRIG010_PIO1_14
#undef DMA0_TRIG010_PIO1_17
#undef DMA0_TRIG010_PIO1_18
#undef DMA0_TRIG010_PIO1_19
#undef DMA0_TRIG010_PIO1_20
#undef DMA0_TRIG010_PIO1_21
#undef DMA0_TRIG010_PIO1_23
#undef DMA0_TRIG010_PIO1_24
#undef DMA0_TRIG010_PIO1_25
#undef DMA0_TRIG010_PIO1_26
#undef DMA0_TRIG010_PIO1_27
#undef DMA0_TRIG010_PIO1_28
#undef DMA0_TRIG010_PIO1_29
#undef DMA0_TRIG010_PIO1_30
#undef DMA0_TRIG010_PIO1_31
#undef DMA0_TRIG010_PIO1_4
#undef DMA0_TRIG010_PIO1_5
#undef DMA0_TRIG010_PIO1_6
#undef DMA0_TRIG010_PIO1_7
#undef DMA0_TRIG010_PIO1_8
#undef DMA0_TRIG010_PIO1_9
#undef DMA0_TRIG011_PIO0_12
#undef DMA0_TRIG011_PIO0_23
#undef DMA0_TRIG011_PIO0_28
#undef DMA0_TRIG011_PIO1_10
#undef DMA0_TRIG011_PIO1_12
#undef DMA0_TRIG011_PIO1_14
#undef DMA0_TRIG011_PIO1_17
#undef DMA0_TRIG011_PIO1_18
#undef DMA0_TRIG011_PIO1_19
#undef DMA0_TRIG011_PIO1_20
#undef DMA0_TRIG011_PIO1_21
#undef DMA0_TRIG011_PIO1_23
#undef DMA0_TRIG011_PIO1_24
#undef DMA0_TRIG011_PIO1_25
#undef DMA0_TRIG011_PIO1_26
#undef DMA0_TRIG011_PIO1_27
#undef DMA0_TRIG011_PIO1_28
#undef DMA0_TRIG011_PIO1_29
#undef DMA0_TRIG011_PIO1_30
#undef DMA0_TRIG011_PIO1_31
#undef DMA0_TRIG011_PIO1_4
#undef DMA0_TRIG011_PIO1_5
#undef DMA0_TRIG011_PIO1_6
#undef DMA0_TRIG011_PIO1_7
#undef DMA0_TRIG011_PIO1_8
#undef DMA0_TRIG011_PIO1_9
#undef DMA0_TRIG012_PIO0_12
#undef DMA0_TRIG012_PIO0_23
#undef DMA0_TRIG012_PIO0_28
#undef DMA0_TRIG012_PIO1_10
#undef DMA0_TRIG012_PIO1_12
#undef DMA0_TRIG012_PIO1_14
#undef DMA0_TRIG012_PIO1_17
#undef DMA0_TRIG012_PIO1_18
#undef DMA0_TRIG012_PIO1_19
#undef DMA0_TRIG012_PIO1_20
#undef DMA0_TRIG012_PIO1_21
#undef DMA0_TRIG012_PIO1_23
#undef DMA0_TRIG012_PIO1_24
#undef DMA0_TRIG012_PIO1_25
#undef DMA0_TRIG012_PIO1_26
#undef DMA0_TRIG012_PIO1_27
#undef DMA0_TRIG012_PIO1_28
#undef DMA0_TRIG012_PIO1_29
#undef DMA0_TRIG012_PIO1_30
#undef DMA0_TRIG012_PIO1_31
#undef DMA0_TRIG012_PIO1_4
#undef DMA0_TRIG012_PIO1_5
#undef DMA0_TRIG012_PIO1_6
#undef DMA0_TRIG012_PIO1_7
#undef DMA0_TRIG012_PIO1_8
#undef DMA0_TRIG012_PIO1_9
#undef DMA0_TRIG013_PIO0_12
#undef DMA0_TRIG013_PIO0_23
#undef DMA0_TRIG013_PIO0_28
#undef DMA0_TRIG013_PIO1_10
#undef DMA0_TRIG013_PIO1_12
#undef DMA0_TRIG013_PIO1_14
#undef DMA0_TRIG013_PIO1_17
#undef DMA0_TRIG013_PIO1_18
#undef DMA0_TRIG013_PIO1_19
#undef DMA0_TRIG013_PIO1_20
#undef DMA0_TRIG013_PIO1_21
#undef DMA0_TRIG013_PIO1_23
#undef DMA0_TRIG013_PIO1_24
#undef DMA0_TRIG013_PIO1_25
#undef DMA0_TRIG013_PIO1_26
#undef DMA0_TRIG013_PIO1_27
#undef DMA0_TRIG013_PIO1_28
#undef DMA0_TRIG013_PIO1_29
#undef DMA0_TRIG013_PIO1_30
#undef DMA0_TRIG013_PIO1_31
#undef DMA0_TRIG013_PIO1_4
#undef DMA0_TRIG013_PIO1_5
#undef DMA0_TRIG013_PIO1_6
#undef DMA0_TRIG013_PIO1_7
#undef DMA0_TRIG013_PIO1_8
#undef DMA0_TRIG013_PIO1_9
#undef DMA0_TRIG014_PIO0_12
#undef DMA0_TRIG014_PIO0_23
#undef DMA0_TRIG014_PIO0_28
#undef DMA0_TRIG014_PIO1_10
#undef DMA0_TRIG014_PIO1_12
#undef DMA0_TRIG014_PIO1_14
#undef DMA0_TRIG014_PIO1_17
#undef DMA0_TRIG014_PIO1_18
#undef DMA0_TRIG014_PIO1_19
#undef DMA0_TRIG014_PIO1_20
#undef DMA0_TRIG014_PIO1_21
#undef DMA0_TRIG014_PIO1_23
#undef DMA0_TRIG014_PIO1_24
#undef DMA0_TRIG014_PIO1_25
#undef DMA0_TRIG014_PIO1_26
#undef DMA0_TRIG014_PIO1_27
#undef DMA0_TRIG014_PIO1_28
#undef DMA0_TRIG014_PIO1_29
#undef DMA0_TRIG014_PIO1_30
#undef DMA0_TRIG014_PIO1_31
#undef DMA0_TRIG014_PIO1_4
#undef DMA0_TRIG014_PIO1_5
#undef DMA0_TRIG014_PIO1_6
#undef DMA0_TRIG014_PIO1_7
#undef DMA0_TRIG014_PIO1_8
#undef DMA0_TRIG014_PIO1_9
#undef DMA0_TRIG015_PIO0_12
#undef DMA0_TRIG015_PIO0_23
#undef DMA0_TRIG015_PIO0_28
#undef DMA0_TRIG015_PIO1_10
#undef DMA0_TRIG015_PIO1_12
#undef DMA0_TRIG015_PIO1_14
#undef DMA0_TRIG015_PIO1_17
#undef DMA0_TRIG015_PIO1_18
#undef DMA0_TRIG015_PIO1_19
#undef DMA0_TRIG015_PIO1_20
#undef DMA0_TRIG015_PIO1_21
#undef DMA0_TRIG015_PIO1_23
#undef DMA0_TRIG015_PIO1_24
#undef DMA0_TRIG015_PIO1_25
#undef DMA0_TRIG015_PIO1_26
#undef DMA0_TRIG015_PIO1_27
#undef DMA0_TRIG015_PIO1_28
#undef DMA0_TRIG015_PIO1_29
#undef DMA0_TRIG015_PIO1_30
#undef DMA0_TRIG015_PIO1_31
#undef DMA0_TRIG015_PIO1_4
#undef DMA0_TRIG015_PIO1_5
#undef DMA0_TRIG015_PIO1_6
#undef DMA0_TRIG015_PIO1_7
#undef DMA0_TRIG015_PIO1_8
#undef DMA0_TRIG015_PIO1_9
#undef DMA0_TRIG016_PIO0_12
#undef DMA0_TRIG016_PIO0_23
#undef DMA0_TRIG016_PIO0_28
#undef DMA0_TRIG016_PIO1_10
#undef DMA0_TRIG016_PIO1_12
#undef DMA0_TRIG016_PIO1_14
#undef DMA0_TRIG016_PIO1_17
#undef DMA0_TRIG016_PIO1_18
#undef DMA0_TRIG016_PIO1_19
#undef DMA0_TRIG016_PIO1_20
#undef DMA0_TRIG016_PIO1_21
#undef DMA0_TRIG016_PIO1_23
#undef DMA0_TRIG016_PIO1_24
#undef DMA0_TRIG016_PIO1_25
#undef DMA0_TRIG016_PIO1_26
#undef DMA0_TRIG016_PIO1_27
#undef DMA0_TRIG016_PIO1_28
#undef DMA0_TRIG016_PIO1_29
#undef DMA0_TRIG016_PIO1_30
#undef DMA0_TRIG016_PIO1_31
#undef DMA0_TRIG016_PIO1_4
#undef DMA0_TRIG016_PIO1_5
#undef DMA0_TRIG016_PIO1_6
#undef DMA0_TRIG016_PIO1_7
#undef DMA0_TRIG016_PIO1_8
#undef DMA0_TRIG016_PIO1_9
#undef DMA0_TRIG017_PIO0_12
#undef DMA0_TRIG017_PIO0_23
#undef DMA0_TRIG017_PIO0_28
#undef DMA0_TRIG017_PIO1_10
#undef DMA0_TRIG017_PIO1_12
#undef DMA0_TRIG017_PIO1_14
#undef DMA0_TRIG017_PIO1_17
#undef DMA0_TRIG017_PIO1_18
#undef DMA0_TRIG017_PIO1_19
#undef DMA0_TRIG017_PIO1_20
#undef DMA0_TRIG017_PIO1_21
#undef DMA0_TRIG017_PIO1_23
#undef DMA0_TRIG017_PIO1_24
#undef DMA0_TRIG017_PIO1_25
#undef DMA0_TRIG017_PIO1_26
#undef DMA0_TRIG017_PIO1_27
#undef DMA0_TRIG017_PIO1_28
#undef DMA0_TRIG017_PIO1_29
#undef DMA0_TRIG017_PIO1_30
#undef DMA0_TRIG017_PIO1_31
#undef DMA0_TRIG017_PIO1_4
#undef DMA0_TRIG017_PIO1_5
#undef DMA0_TRIG017_PIO1_6
#undef DMA0_TRIG017_PIO1_7
#undef DMA0_TRIG017_PIO1_8
#undef DMA0_TRIG017_PIO1_9
#undef DMA0_TRIG018_PIO0_12
#undef DMA0_TRIG018_PIO0_23
#undef DMA0_TRIG018_PIO0_28
#undef DMA0_TRIG018_PIO1_10
#undef DMA0_TRIG018_PIO1_12
#undef DMA0_TRIG018_PIO1_14
#undef DMA0_TRIG018_PIO1_17
#undef DMA0_TRIG018_PIO1_18
#undef DMA0_TRIG018_PIO1_19
#undef DMA0_TRIG018_PIO1_20
#undef DMA0_TRIG018_PIO1_21
#undef DMA0_TRIG018_PIO1_23
#undef DMA0_TRIG018_PIO1_24
#undef DMA0_TRIG018_PIO1_25
#undef DMA0_TRIG018_PIO1_26
#undef DMA0_TRIG018_PIO1_27
#undef DMA0_TRIG018_PIO1_28
#undef DMA0_TRIG018_PIO1_29
#undef DMA0_TRIG018_PIO1_30
#undef DMA0_TRIG018_PIO1_31
#undef DMA0_TRIG018_PIO1_4
#undef DMA0_TRIG018_PIO1_5
#undef DMA0_TRIG018_PIO1_6
#undef DMA0_TRIG018_PIO1_7
#undef DMA0_TRIG018_PIO1_8
#undef DMA0_TRIG018_PIO1_9
#undef DMA0_TRIG019_PIO0_12
#undef DMA0_TRIG019_PIO0_23
#undef DMA0_TRIG019_PIO0_28
#undef DMA0_TRIG019_PIO1_10
#undef DMA0_TRIG019_PIO1_12
#undef DMA0_TRIG019_PIO1_14
#undef DMA0_TRIG019_PIO1_17
#undef DMA0_TRIG019_PIO1_18
#undef DMA0_TRIG019_PIO1_19
#undef DMA0_TRIG019_PIO1_20
#undef DMA0_TRIG019_PIO1_21
#undef DMA0_TRIG019_PIO1_23
#undef DMA0_TRIG019_PIO1_24
#undef DMA0_TRIG019_PIO1_25
#undef DMA0_TRIG019_PIO1_26
#undef DMA0_TRIG019_PIO1_27
#undef DMA0_TRIG019_PIO1_28
#undef DMA0_TRIG019_PIO1_29
#undef DMA0_TRIG019_PIO1_30
#undef DMA0_TRIG019_PIO1_31
#undef DMA0_TRIG019_PIO1_4
#undef DMA0_TRIG019_PIO1_5
#undef DMA0_TRIG019_PIO1_6
#undef DMA0_TRIG019_PIO1_7
#undef DMA0_TRIG019_PIO1_8
#undef DMA0_TRIG019_PIO1_9
#undef DMA0_TRIG01_PIO0_12
#undef DMA0_TRIG01_PIO0_23
#undef DMA0_TRIG01_PIO0_28
#undef DMA0_TRIG01_PIO1_10
#undef DMA0_TRIG01_PIO1_12
#undef DMA0_TRIG01_PIO1_14
#undef DMA0_TRIG01_PIO1_17
#undef DMA0_TRIG01_PIO1_18
#undef DMA0_TRIG01_PIO1_19
#undef DMA0_TRIG01_PIO1_20
#undef DMA0_TRIG01_PIO1_21
#undef DMA0_TRIG01_PIO1_23
#undef DMA0_TRIG01_PIO1_24
#undef DMA0_TRIG01_PIO1_25
#undef DMA0_TRIG01_PIO1_26
#undef DMA0_TRIG01_PIO1_27
#undef DMA0_TRIG01_PIO1_28
#undef DMA0_TRIG01_PIO1_29
#undef DMA0_TRIG01_PIO1_30
#undef DMA0_TRIG01_PIO1_31
#undef DMA0_TRIG01_PIO1_4
#undef DMA0_TRIG01_PIO1_5
#undef DMA0_TRIG01_PIO1_6
#undef DMA0_TRIG01_PIO1_7
#undef DMA0_TRIG01_PIO1_8
#undef DMA0_TRIG01_PIO1_9
#undef DMA0_TRIG020_PIO0_12
#undef DMA0_TRIG020_PIO0_23
#undef DMA0_TRIG020_PIO0_28
#undef DMA0_TRIG020_PIO1_10
#undef DMA0_TRIG020_PIO1_12
#undef DMA0_TRIG020_PIO1_14
#undef DMA0_TRIG020_PIO1_17
#undef DMA0_TRIG020_PIO1_18
#undef DMA0_TRIG020_PIO1_19
#undef DMA0_TRIG020_PIO1_20
#undef DMA0_TRIG020_PIO1_21
#undef DMA0_TRIG020_PIO1_23
#undef DMA0_TRIG020_PIO1_24
#undef DMA0_TRIG020_PIO1_25
#undef DMA0_TRIG020_PIO1_26
#undef DMA0_TRIG020_PIO1_27
#undef DMA0_TRIG020_PIO1_28
#undef DMA0_TRIG020_PIO1_29
#undef DMA0_TRIG020_PIO1_30
#undef DMA0_TRIG020_PIO1_31
#undef DMA0_TRIG020_PIO1_4
#undef DMA0_TRIG020_PIO1_5
#undef DMA0_TRIG020_PIO1_6
#undef DMA0_TRIG020_PIO1_7
#undef DMA0_TRIG020_PIO1_8
#undef DMA0_TRIG020_PIO1_9
#undef DMA0_TRIG021_PIO0_12
#undef DMA0_TRIG021_PIO0_23
#undef DMA0_TRIG021_PIO0_28
#undef DMA0_TRIG021_PIO1_10
#undef DMA0_TRIG021_PIO1_12
#undef DMA0_TRIG021_PIO1_14
#undef DMA0_TRIG021_PIO1_17
#undef DMA0_TRIG021_PIO1_18
#undef DMA0_TRIG021_PIO1_19
#undef DMA0_TRIG021_PIO1_20
#undef DMA0_TRIG021_PIO1_21
#undef DMA0_TRIG021_PIO1_23
#undef DMA0_TRIG021_PIO1_24
#undef DMA0_TRIG021_PIO1_25
#undef DMA0_TRIG021_PIO1_26
#undef DMA0_TRIG021_PIO1_27
#undef DMA0_TRIG021_PIO1_28
#undef DMA0_TRIG021_PIO1_29
#undef DMA0_TRIG021_PIO1_30
#undef DMA0_TRIG021_PIO1_31
#undef DMA0_TRIG021_PIO1_4
#undef DMA0_TRIG021_PIO1_5
#undef DMA0_TRIG021_PIO1_6
#undef DMA0_TRIG021_PIO1_7
#undef DMA0_TRIG021_PIO1_8
#undef DMA0_TRIG021_PIO1_9
#undef DMA0_TRIG022_PIO0_12
#undef DMA0_TRIG022_PIO0_23
#undef DMA0_TRIG022_PIO0_28
#undef DMA0_TRIG022_PIO1_10
#undef DMA0_TRIG022_PIO1_12
#undef DMA0_TRIG022_PIO1_14
#undef DMA0_TRIG022_PIO1_17
#undef DMA0_TRIG022_PIO1_18
#undef DMA0_TRIG022_PIO1_19
#undef DMA0_TRIG022_PIO1_20
#undef DMA0_TRIG022_PIO1_21
#undef DMA0_TRIG022_PIO1_23
#undef DMA0_TRIG022_PIO1_24
#undef DMA0_TRIG022_PIO1_25
#undef DMA0_TRIG022_PIO1_26
#undef DMA0_TRIG022_PIO1_27
#undef DMA0_TRIG022_PIO1_28
#undef DMA0_TRIG022_PIO1_29
#undef DMA0_TRIG022_PIO1_30
#undef DMA0_TRIG022_PIO1_31
#undef DMA0_TRIG022_PIO1_4
#undef DMA0_TRIG022_PIO1_5
#undef DMA0_TRIG022_PIO1_6
#undef DMA0_TRIG022_PIO1_7
#undef DMA0_TRIG022_PIO1_8
#undef DMA0_TRIG022_PIO1_9
#undef DMA0_TRIG023_PIO0_12
#undef DMA0_TRIG023_PIO0_23
#undef DMA0_TRIG023_PIO0_28
#undef DMA0_TRIG023_PIO1_10
#undef DMA0_TRIG023_PIO1_12
#undef DMA0_TRIG023_PIO1_14
#undef DMA0_TRIG023_PIO1_17
#undef DMA0_TRIG023_PIO1_18
#undef DMA0_TRIG023_PIO1_19
#undef DMA0_TRIG023_PIO1_20
#undef DMA0_TRIG023_PIO1_21
#undef DMA0_TRIG023_PIO1_23
#undef DMA0_TRIG023_PIO1_24
#undef DMA0_TRIG023_PIO1_25
#undef DMA0_TRIG023_PIO1_26
#undef DMA0_TRIG023_PIO1_27
#undef DMA0_TRIG023_PIO1_28
#undef DMA0_TRIG023_PIO1_29
#undef DMA0_TRIG023_PIO1_30
#undef DMA0_TRIG023_PIO1_31
#undef DMA0_TRIG023_PIO1_4
#undef DMA0_TRIG023_PIO1_5
#undef DMA0_TRIG023_PIO1_6
#undef DMA0_TRIG023_PIO1_7
#undef DMA0_TRIG023_PIO1_8
#undef DMA0_TRIG023_PIO1_9
#undef DMA0_TRIG024_PIO0_12
#undef DMA0_TRIG024_PIO0_23
#undef DMA0_TRIG024_PIO0_28
#undef DMA0_TRIG024_PIO1_10
#undef DMA0_TRIG024_PIO1_12
#undef DMA0_TRIG024_PIO1_14
#undef DMA0_TRIG024_PIO1_17
#undef DMA0_TRIG024_PIO1_18
#undef DMA0_TRIG024_PIO1_19
#undef DMA0_TRIG024_PIO1_20
#undef DMA0_TRIG024_PIO1_21
#undef DMA0_TRIG024_PIO1_23
#undef DMA0_TRIG024_PIO1_24
