zephyrproject-rtos/hal_nxp/dts/nxp/lpc/lpc55xxx/pinctrl/LPC5536JBD64-pinctrl.h
#undef DMA0_TRIG024_PIO1_25
#undef DMA0_TRIG024_PIO1_26
#undef DMA0_TRIG024_PIO1_27
#undef DMA0_TRIG024_PIO1_28
#undef DMA0_TRIG024_PIO1_29
#undef DMA0_TRIG024_PIO1_30
#undef DMA0_TRIG024_PIO1_31
#undef DMA0_TRIG024_PIO1_4
#undef DMA0_TRIG024_PIO1_5
#undef DMA0_TRIG024_PIO1_6
#undef DMA0_TRIG024_PIO1_7
#undef DMA0_TRIG024_PIO1_8
#undef DMA0_TRIG024_PIO1_9
#undef DMA0_TRIG025_PIO0_12
#undef DMA0_TRIG025_PIO0_23
#undef DMA0_TRIG025_PIO0_28
#undef DMA0_TRIG025_PIO1_10
#undef DMA0_TRIG025_PIO1_12
#undef DMA0_TRIG025_PIO1_14
#undef DMA0_TRIG025_PIO1_17
#undef DMA0_TRIG025_PIO1_18
#undef DMA0_TRIG025_PIO1_19
#undef DMA0_TRIG025_PIO1_20
#undef DMA0_TRIG025_PIO1_21
#undef DMA0_TRIG025_PIO1_23
#undef DMA0_TRIG025_PIO1_24
#undef DMA0_TRIG025_PIO1_25
#undef DMA0_TRIG025_PIO1_26
#undef DMA0_TRIG025_PIO1_27
#undef DMA0_TRIG025_PIO1_28
#undef DMA0_TRIG025_PIO1_29
#undef DMA0_TRIG025_PIO1_30
#undef DMA0_TRIG025_PIO1_31
#undef DMA0_TRIG025_PIO1_4
#undef DMA0_TRIG025_PIO1_5
#undef DMA0_TRIG025_PIO1_6
#undef DMA0_TRIG025_PIO1_7
#undef DMA0_TRIG025_PIO1_8
#undef DMA0_TRIG025_PIO1_9
#undef DMA0_TRIG026_PIO0_12
#undef DMA0_TRIG026_PIO0_23
#undef DMA0_TRIG026_PIO0_28
#undef DMA0_TRIG026_PIO1_10
#undef DMA0_TRIG026_PIO1_12
#undef DMA0_TRIG026_PIO1_14
#undef DMA0_TRIG026_PIO1_17
#undef DMA0_TRIG026_PIO1_18
#undef DMA0_TRIG026_PIO1_19
#undef DMA0_TRIG026_PIO1_20
#undef DMA0_TRIG026_PIO1_21
#undef DMA0_TRIG026_PIO1_23
#undef DMA0_TRIG026_PIO1_24
#undef DMA0_TRIG026_PIO1_25
#undef DMA0_TRIG026_PIO1_26
#undef DMA0_TRIG026_PIO1_27
#undef DMA0_TRIG026_PIO1_28
#undef DMA0_TRIG026_PIO1_29
#undef DMA0_TRIG026_PIO1_30
#undef DMA0_TRIG026_PIO1_31
#undef DMA0_TRIG026_PIO1_4
#undef DMA0_TRIG026_PIO1_5
#undef DMA0_TRIG026_PIO1_6
#undef DMA0_TRIG026_PIO1_7
#undef DMA0_TRIG026_PIO1_8
#undef DMA0_TRIG026_PIO1_9
#undef DMA0_TRIG027_PIO0_12
#undef DMA0_TRIG027_PIO0_23
#undef DMA0_TRIG027_PIO0_28
#undef DMA0_TRIG027_PIO1_10
#undef DMA0_TRIG027_PIO1_12
#undef DMA0_TRIG027_PIO1_14
#undef DMA0_TRIG027_PIO1_17
#undef DMA0_TRIG027_PIO1_18
#undef DMA0_TRIG027_PIO1_19
#undef DMA0_TRIG027_PIO1_20
#undef DMA0_TRIG027_PIO1_21
#undef DMA0_TRIG027_PIO1_23
#undef DMA0_TRIG027_PIO1_24
#undef DMA0_TRIG027_PIO1_25
#undef DMA0_TRIG027_PIO1_26
#undef DMA0_TRIG027_PIO1_27
#undef DMA0_TRIG027_PIO1_28
#undef DMA0_TRIG027_PIO1_29
#undef DMA0_TRIG027_PIO1_30
#undef DMA0_TRIG027_PIO1_31
#undef DMA0_TRIG027_PIO1_4
#undef DMA0_TRIG027_PIO1_5
#undef DMA0_TRIG027_PIO1_6
#undef DMA0_TRIG027_PIO1_7
#undef DMA0_TRIG027_PIO1_8
#undef DMA0_TRIG027_PIO1_9
#undef DMA0_TRIG028_PIO0_12
#undef DMA0_TRIG028_PIO0_23
#undef DMA0_TRIG028_PIO0_28
#undef DMA0_TRIG028_PIO1_10
#undef DMA0_TRIG028_PIO1_12
#undef DMA0_TRIG028_PIO1_14
#undef DMA0_TRIG028_PIO1_17
#undef DMA0_TRIG028_PIO1_18
#undef DMA0_TRIG028_PIO1_19
#undef DMA0_TRIG028_PIO1_20
#undef DMA0_TRIG028_PIO1_21
#undef DMA0_TRIG028_PIO1_23
#undef DMA0_TRIG028_PIO1_24
#undef DMA0_TRIG028_PIO1_25
#undef DMA0_TRIG028_PIO1_26
#undef DMA0_TRIG028_PIO1_27
#undef DMA0_TRIG028_PIO1_28
#undef DMA0_TRIG028_PIO1_29
#undef DMA0_TRIG028_PIO1_30
#undef DMA0_TRIG028_PIO1_31
#undef DMA0_TRIG028_PIO1_4
#undef DMA0_TRIG028_PIO1_5
#undef DMA0_TRIG028_PIO1_6
#undef DMA0_TRIG028_PIO1_7
#undef DMA0_TRIG028_PIO1_8
#undef DMA0_TRIG028_PIO1_9
#undef DMA0_TRIG029_PIO0_12
#undef DMA0_TRIG029_PIO0_23
#undef DMA0_TRIG029_PIO0_28
#undef DMA0_TRIG029_PIO1_10
#undef DMA0_TRIG029_PIO1_12
#undef DMA0_TRIG029_PIO1_14
#undef DMA0_TRIG029_PIO1_17
#undef DMA0_TRIG029_PIO1_18
#undef DMA0_TRIG029_PIO1_19
#undef DMA0_TRIG029_PIO1_20
#undef DMA0_TRIG029_PIO1_21
#undef DMA0_TRIG029_PIO1_23
#undef DMA0_TRIG029_PIO1_24
#undef DMA0_TRIG029_PIO1_25
#undef DMA0_TRIG029_PIO1_26
#undef DMA0_TRIG029_PIO1_27
#undef DMA0_TRIG029_PIO1_28
#undef DMA0_TRIG029_PIO1_29
#undef DMA0_TRIG029_PIO1_30
#undef DMA0_TRIG029_PIO1_31
#undef DMA0_TRIG029_PIO1_4
#undef DMA0_TRIG029_PIO1_5
#undef DMA0_TRIG029_PIO1_6
#undef DMA0_TRIG029_PIO1_7
#undef DMA0_TRIG029_PIO1_8
#undef DMA0_TRIG029_PIO1_9
#undef DMA0_TRIG02_PIO0_12
#undef DMA0_TRIG02_PIO0_23
#undef DMA0_TRIG02_PIO0_28
#undef DMA0_TRIG02_PIO1_10
#undef DMA0_TRIG02_PIO1_12
#undef DMA0_TRIG02_PIO1_14
#undef DMA0_TRIG02_PIO1_17
#undef DMA0_TRIG02_PIO1_18
#undef DMA0_TRIG02_PIO1_19
#undef DMA0_TRIG02_PIO1_20
#undef DMA0_TRIG02_PIO1_21
#undef DMA0_TRIG02_PIO1_23
#undef DMA0_TRIG02_PIO1_24
#undef DMA0_TRIG02_PIO1_25
#undef DMA0_TRIG02_PIO1_26
#undef DMA0_TRIG02_PIO1_27
#undef DMA0_TRIG02_PIO1_28
#undef DMA0_TRIG02_PIO1_29
#undef DMA0_TRIG02_PIO1_30
#undef DMA0_TRIG02_PIO1_31
#undef DMA0_TRIG02_PIO1_4
#undef DMA0_TRIG02_PIO1_5
#undef DMA0_TRIG02_PIO1_6
#undef DMA0_TRIG02_PIO1_7
#undef DMA0_TRIG02_PIO1_8
#undef DMA0_TRIG02_PIO1_9
#undef DMA0_TRIG030_PIO0_12
#undef DMA0_TRIG030_PIO0_23
#undef DMA0_TRIG030_PIO0_28
#undef DMA0_TRIG030_PIO1_10
#undef DMA0_TRIG030_PIO1_12
#undef DMA0_TRIG030_PIO1_14
#undef DMA0_TRIG030_PIO1_17
#undef DMA0_TRIG030_PIO1_18
#undef DMA0_TRIG030_PIO1_19
#undef DMA0_TRIG030_PIO1_20
#undef DMA0_TRIG030_PIO1_21
#undef DMA0_TRIG030_PIO1_23
#undef DMA0_TRIG030_PIO1_24
#undef DMA0_TRIG030_PIO1_25
#undef DMA0_TRIG030_PIO1_26
#undef DMA0_TRIG030_PIO1_27
#undef DMA0_TRIG030_PIO1_28
#undef DMA0_TRIG030_PIO1_29
#undef DMA0_TRIG030_PIO1_30
#undef DMA0_TRIG030_PIO1_31
#undef DMA0_TRIG030_PIO1_4
#undef DMA0_TRIG030_PIO1_5
#undef DMA0_TRIG030_PIO1_6
#undef DMA0_TRIG030_PIO1_7
#undef DMA0_TRIG030_PIO1_8
#undef DMA0_TRIG030_PIO1_9
#undef DMA0_TRIG031_PIO0_12
#undef DMA0_TRIG031_PIO0_23
#undef DMA0_TRIG031_PIO0_28
#undef DMA0_TRIG031_PIO1_10
#undef DMA0_TRIG031_PIO1_12
#undef DMA0_TRIG031_PIO1_14
#undef DMA0_TRIG031_PIO1_17
#undef DMA0_TRIG031_PIO1_18
#undef DMA0_TRIG031_PIO1_19
#undef DMA0_TRIG031_PIO1_20
#undef DMA0_TRIG031_PIO1_21
#undef DMA0_TRIG031_PIO1_23
#undef DMA0_TRIG031_PIO1_24
#undef DMA0_TRIG031_PIO1_25
#undef DMA0_TRIG031_PIO1_26
#undef DMA0_TRIG031_PIO1_27
#undef DMA0_TRIG031_PIO1_28
#undef DMA0_TRIG031_PIO1_29
#undef DMA0_TRIG031_PIO1_30
#undef DMA0_TRIG031_PIO1_31
#undef DMA0_TRIG031_PIO1_4
#undef DMA0_TRIG031_PIO1_5
#undef DMA0_TRIG031_PIO1_6
#undef DMA0_TRIG031_PIO1_7
#undef DMA0_TRIG031_PIO1_8
#undef DMA0_TRIG031_PIO1_9
#undef DMA0_TRIG032_PIO0_12
#undef DMA0_TRIG032_PIO0_23
#undef DMA0_TRIG032_PIO0_28
#undef DMA0_TRIG032_PIO1_10
#undef DMA0_TRIG032_PIO1_12
#undef DMA0_TRIG032_PIO1_14
#undef DMA0_TRIG032_PIO1_17
#undef DMA0_TRIG032_PIO1_18
#undef DMA0_TRIG032_PIO1_19
#undef DMA0_TRIG032_PIO1_20
#undef DMA0_TRIG032_PIO1_21
#undef DMA0_TRIG032_PIO1_23
#undef DMA0_TRIG032_PIO1_24
#undef DMA0_TRIG032_PIO1_25
#undef DMA0_TRIG032_PIO1_26
#undef DMA0_TRIG032_PIO1_27
#undef DMA0_TRIG032_PIO1_28
#undef DMA0_TRIG032_PIO1_29
#undef DMA0_TRIG032_PIO1_30
#undef DMA0_TRIG032_PIO1_31
#undef DMA0_TRIG032_PIO1_4
#undef DMA0_TRIG032_PIO1_5
#undef DMA0_TRIG032_PIO1_6
#undef DMA0_TRIG032_PIO1_7
#undef DMA0_TRIG032_PIO1_8
#undef DMA0_TRIG032_PIO1_9
#undef DMA0_TRIG033_PIO0_12
#undef DMA0_TRIG033_PIO0_23
#undef DMA0_TRIG033_PIO0_28
#undef DMA0_TRIG033_PIO1_10
#undef DMA0_TRIG033_PIO1_12
#undef DMA0_TRIG033_PIO1_14
#undef DMA0_TRIG033_PIO1_17
#undef DMA0_TRIG033_PIO1_18
#undef DMA0_TRIG033_PIO1_19
#undef DMA0_TRIG033_PIO1_20
#undef DMA0_TRIG033_PIO1_21
#undef DMA0_TRIG033_PIO1_23
#undef DMA0_TRIG033_PIO1_24
#undef DMA0_TRIG033_PIO1_25
#undef DMA0_TRIG033_PIO1_26
#undef DMA0_TRIG033_PIO1_27
#undef DMA0_TRIG033_PIO1_28
#undef DMA0_TRIG033_PIO1_29
#undef DMA0_TRIG033_PIO1_30
#undef DMA0_TRIG033_PIO1_31
#undef DMA0_TRIG033_PIO1_4
#undef DMA0_TRIG033_PIO1_5
#undef DMA0_TRIG033_PIO1_6
#undef DMA0_TRIG033_PIO1_7
#undef DMA0_TRIG033_PIO1_8
#undef DMA0_TRIG033_PIO1_9
#undef DMA0_TRIG034_PIO0_12
#undef DMA0_TRIG034_PIO0_23
#undef DMA0_TRIG034_PIO0_28
#undef DMA0_TRIG034_PIO1_10
#undef DMA0_TRIG034_PIO1_12
#undef DMA0_TRIG034_PIO1_14
#undef DMA0_TRIG034_PIO1_17
#undef DMA0_TRIG034_PIO1_18
#undef DMA0_TRIG034_PIO1_19
#undef DMA0_TRIG034_PIO1_20
#undef DMA0_TRIG034_PIO1_21
#undef DMA0_TRIG034_PIO1_23
#undef DMA0_TRIG034_PIO1_24
#undef DMA0_TRIG034_PIO1_25
#undef DMA0_TRIG034_PIO1_26
#undef DMA0_TRIG034_PIO1_27
#undef DMA0_TRIG034_PIO1_28
#undef DMA0_TRIG034_PIO1_29
#undef DMA0_TRIG034_PIO1_30
#undef DMA0_TRIG034_PIO1_31
#undef DMA0_TRIG034_PIO1_4
#undef DMA0_TRIG034_PIO1_5
#undef DMA0_TRIG034_PIO1_6
#undef DMA0_TRIG034_PIO1_7
#undef DMA0_TRIG034_PIO1_8
#undef DMA0_TRIG034_PIO1_9
#undef DMA0_TRIG035_PIO0_12
#undef DMA0_TRIG035_PIO0_23
#undef DMA0_TRIG035_PIO0_28
#undef DMA0_TRIG035_PIO1_10
#undef DMA0_TRIG035_PIO1_12
#undef DMA0_TRIG035_PIO1_14
#undef DMA0_TRIG035_PIO1_17
#undef DMA0_TRIG035_PIO1_18
#undef DMA0_TRIG035_PIO1_19
#undef DMA0_TRIG035_PIO1_20
#undef DMA0_TRIG035_PIO1_21
#undef DMA0_TRIG035_PIO1_23
#undef DMA0_TRIG035_PIO1_24
#undef DMA0_TRIG035_PIO1_25
#undef DMA0_TRIG035_PIO1_26
#undef DMA0_TRIG035_PIO1_27
#undef DMA0_TRIG035_PIO1_28
#undef DMA0_TRIG035_PIO1_29
#undef DMA0_TRIG035_PIO1_30
#undef DMA0_TRIG035_PIO1_31
#undef DMA0_TRIG035_PIO1_4
#undef DMA0_TRIG035_PIO1_5
#undef DMA0_TRIG035_PIO1_6
#undef DMA0_TRIG035_PIO1_7
#undef DMA0_TRIG035_PIO1_8
#undef DMA0_TRIG035_PIO1_9
#undef DMA0_TRIG036_PIO0_12
#undef DMA0_TRIG036_PIO0_23
#undef DMA0_TRIG036_PIO0_28
#undef DMA0_TRIG036_PIO1_10
#undef DMA0_TRIG036_PIO1_12
#undef DMA0_TRIG036_PIO1_14
#undef DMA0_TRIG036_PIO1_17
#undef DMA0_TRIG036_PIO1_18
#undef DMA0_TRIG036_PIO1_19
#undef DMA0_TRIG036_PIO1_20
#undef DMA0_TRIG036_PIO1_21
#undef DMA0_TRIG036_PIO1_23
#undef DMA0_TRIG036_PIO1_24
#undef DMA0_TRIG036_PIO1_25
#undef DMA0_TRIG036_PIO1_26
#undef DMA0_TRIG036_PIO1_27
#undef DMA0_TRIG036_PIO1_28
#undef DMA0_TRIG036_PIO1_29
#undef DMA0_TRIG036_PIO1_30
#undef DMA0_TRIG036_PIO1_31
#undef DMA0_TRIG036_PIO1_4
#undef DMA0_TRIG036_PIO1_5
#undef DMA0_TRIG036_PIO1_6
#undef DMA0_TRIG036_PIO1_7
#undef DMA0_TRIG036_PIO1_8
#undef DMA0_TRIG036_PIO1_9
#undef DMA0_TRIG037_PIO0_12
#undef DMA0_TRIG037_PIO0_23
#undef DMA0_TRIG037_PIO0_28
#undef DMA0_TRIG037_PIO1_10
#undef DMA0_TRIG037_PIO1_12
#undef DMA0_TRIG037_PIO1_14
#undef DMA0_TRIG037_PIO1_17
#undef DMA0_TRIG037_PIO1_18
#undef DMA0_TRIG037_PIO1_19
#undef DMA0_TRIG037_PIO1_20
#undef DMA0_TRIG037_PIO1_21
#undef DMA0_TRIG037_PIO1_23
#undef DMA0_TRIG037_PIO1_24
#undef DMA0_TRIG037_PIO1_25
#undef DMA0_TRIG037_PIO1_26
#undef DMA0_TRIG037_PIO1_27
#undef DMA0_TRIG037_PIO1_28
#undef DMA0_TRIG037_PIO1_29
#undef DMA0_TRIG037_PIO1_30
#undef DMA0_TRIG037_PIO1_31
#undef DMA0_TRIG037_PIO1_4
#undef DMA0_TRIG037_PIO1_5
#undef DMA0_TRIG037_PIO1_6
#undef DMA0_TRIG037_PIO1_7
#undef DMA0_TRIG037_PIO1_8
#undef DMA0_TRIG037_PIO1_9
#undef DMA0_TRIG038_PIO0_12
#undef DMA0_TRIG038_PIO0_23
#undef DMA0_TRIG038_PIO0_28
#undef DMA0_TRIG038_PIO1_10
#undef DMA0_TRIG038_PIO1_12
#undef DMA0_TRIG038_PIO1_14
#undef DMA0_TRIG038_PIO1_17
#undef DMA0_TRIG038_PIO1_18
#undef DMA0_TRIG038_PIO1_19
#undef DMA0_TRIG038_PIO1_20
#undef DMA0_TRIG038_PIO1_21
#undef DMA0_TRIG038_PIO1_23
#undef DMA0_TRIG038_PIO1_24
#undef DMA0_TRIG038_PIO1_25
#undef DMA0_TRIG038_PIO1_26
#undef DMA0_TRIG038_PIO1_27
#undef DMA0_TRIG038_PIO1_28
#undef DMA0_TRIG038_PIO1_29
#undef DMA0_TRIG038_PIO1_30
#undef DMA0_TRIG038_PIO1_31
#undef DMA0_TRIG038_PIO1_4
#undef DMA0_TRIG038_PIO1_5
#undef DMA0_TRIG038_PIO1_6
#undef DMA0_TRIG038_PIO1_7
#undef DMA0_TRIG038_PIO1_8
#undef DMA0_TRIG038_PIO1_9
#undef DMA0_TRIG039_PIO0_12
#undef DMA0_TRIG039_PIO0_23
#undef DMA0_TRIG039_PIO0_28
#undef DMA0_TRIG039_PIO1_10
#undef DMA0_TRIG039_PIO1_12
#undef DMA0_TRIG039_PIO1_14
#undef DMA0_TRIG039_PIO1_17
#undef DMA0_TRIG039_PIO1_18
#undef DMA0_TRIG039_PIO1_19
#undef DMA0_TRIG039_PIO1_20
#undef DMA0_TRIG039_PIO1_21
#undef DMA0_TRIG039_PIO1_23
#undef DMA0_TRIG039_PIO1_24
#undef DMA0_TRIG039_PIO1_25
#undef DMA0_TRIG039_PIO1_26
#undef DMA0_TRIG039_PIO1_27
#undef DMA0_TRIG039_PIO1_28
#undef DMA0_TRIG039_PIO1_29
#undef DMA0_TRIG039_PIO1_30
#undef DMA0_TRIG039_PIO1_31
#undef DMA0_TRIG039_PIO1_4
#undef DMA0_TRIG039_PIO1_5
#undef DMA0_TRIG039_PIO1_6
#undef DMA0_TRIG039_PIO1_7
#undef DMA0_TRIG039_PIO1_8
#undef DMA0_TRIG039_PIO1_9
#undef DMA0_TRIG03_PIO0_12
#undef DMA0_TRIG03_PIO0_23
#undef DMA0_TRIG03_PIO0_28
#undef DMA0_TRIG03_PIO1_10
#undef DMA0_TRIG03_PIO1_12
#undef DMA0_TRIG03_PIO1_14
#undef DMA0_TRIG03_PIO1_17
#undef DMA0_TRIG03_PIO1_18
#undef DMA0_TRIG03_PIO1_19
#undef DMA0_TRIG03_PIO1_20
#undef DMA0_TRIG03_PIO1_21
#undef DMA0_TRIG03_PIO1_23
#undef DMA0_TRIG03_PIO1_24
#undef DMA0_TRIG03_PIO1_25
#undef DMA0_TRIG03_PIO1_26
#undef DMA0_TRIG03_PIO1_27
#undef DMA0_TRIG03_PIO1_28
#undef DMA0_TRIG03_PIO1_29
#undef DMA0_TRIG03_PIO1_30
#undef DMA0_TRIG03_PIO1_31
#undef DMA0_TRIG03_PIO1_4
#undef DMA0_TRIG03_PIO1_5
#undef DMA0_TRIG03_PIO1_6
#undef DMA0_TRIG03_PIO1_7
#undef DMA0_TRIG03_PIO1_8
#undef DMA0_TRIG03_PIO1_9
#undef DMA0_TRIG040_PIO0_12
#undef DMA0_TRIG040_PIO0_23
#undef DMA0_TRIG040_PIO0_28
#undef DMA0_TRIG040_PIO1_10
#undef DMA0_TRIG040_PIO1_12
#undef DMA0_TRIG040_PIO1_14
#undef DMA0_TRIG040_PIO1_17
#undef DMA0_TRIG040_PIO1_18
#undef DMA0_TRIG040_PIO1_19
#undef DMA0_TRIG040_PIO1_20
#undef DMA0_TRIG040_PIO1_21
#undef DMA0_TRIG040_PIO1_23
#undef DMA0_TRIG040_PIO1_24
#undef DMA0_TRIG040_PIO1_25
#undef DMA0_TRIG040_PIO1_26
#undef DMA0_TRIG040_PIO1_27
#undef DMA0_TRIG040_PIO1_28
#undef DMA0_TRIG040_PIO1_29
#undef DMA0_TRIG040_PIO1_30
#undef DMA0_TRIG040_PIO1_31
#undef DMA0_TRIG040_PIO1_4
#undef DMA0_TRIG040_PIO1_5
#undef DMA0_TRIG040_PIO1_6
#undef DMA0_TRIG040_PIO1_7
#undef DMA0_TRIG040_PIO1_8
#undef DMA0_TRIG040_PIO1_9
#undef DMA0_TRIG041_PIO0_12
#undef DMA0_TRIG041_PIO0_23
#undef DMA0_TRIG041_PIO0_28
#undef DMA0_TRIG041_PIO1_10
#undef DMA0_TRIG041_PIO1_12
#undef DMA0_TRIG041_PIO1_14
#undef DMA0_TRIG041_PIO1_17
#undef DMA0_TRIG041_PIO1_18
#undef DMA0_TRIG041_PIO1_19
#undef DMA0_TRIG041_PIO1_20
#undef DMA0_TRIG041_PIO1_21
#undef DMA0_TRIG041_PIO1_23
#undef DMA0_TRIG041_PIO1_24
#undef DMA0_TRIG041_PIO1_25
#undef DMA0_TRIG041_PIO1_26
#undef DMA0_TRIG041_PIO1_27
#undef DMA0_TRIG041_PIO1_28
#undef DMA0_TRIG041_PIO1_29
#undef DMA0_TRIG041_PIO1_30
#undef DMA0_TRIG041_PIO1_31
#undef DMA0_TRIG041_PIO1_4
#undef DMA0_TRIG041_PIO1_5
#undef DMA0_TRIG041_PIO1_6
#undef DMA0_TRIG041_PIO1_7
#undef DMA0_TRIG041_PIO1_8
#undef DMA0_TRIG041_PIO1_9
#undef DMA0_TRIG042_PIO0_12
#undef DMA0_TRIG042_PIO0_23
#undef DMA0_TRIG042_PIO0_28
#undef DMA0_TRIG042_PIO1_10
#undef DMA0_TRIG042_PIO1_12
#undef DMA0_TRIG042_PIO1_14
#undef DMA0_TRIG042_PIO1_17
#undef DMA0_TRIG042_PIO1_18
#undef DMA0_TRIG042_PIO1_19
#undef DMA0_TRIG042_PIO1_20
#undef DMA0_TRIG042_PIO1_21
#undef DMA0_TRIG042_PIO1_23
#undef DMA0_TRIG042_PIO1_24
#undef DMA0_TRIG042_PIO1_25
#undef DMA0_TRIG042_PIO1_26
#undef DMA0_TRIG042_PIO1_27
#undef DMA0_TRIG042_PIO1_28
#undef DMA0_TRIG042_PIO1_29
#undef DMA0_TRIG042_PIO1_30
#undef DMA0_TRIG042_PIO1_31
#undef DMA0_TRIG042_PIO1_4
#undef DMA0_TRIG042_PIO1_5
#undef DMA0_TRIG042_PIO1_6
#undef DMA0_TRIG042_PIO1_7
#undef DMA0_TRIG042_PIO1_8
#undef DMA0_TRIG042_PIO1_9
#undef DMA0_TRIG043_PIO0_12
#undef DMA0_TRIG043_PIO0_23
#undef DMA0_TRIG043_PIO0_28
#undef DMA0_TRIG043_PIO1_10
#undef DMA0_TRIG043_PIO1_12
#undef DMA0_TRIG043_PIO1_14
#undef DMA0_TRIG043_PIO1_17
#undef DMA0_TRIG043_PIO1_18
#undef DMA0_TRIG043_PIO1_19
#undef DMA0_TRIG043_PIO1_20
#undef DMA0_TRIG043_PIO1_21
#undef DMA0_TRIG043_PIO1_23
#undef DMA0_TRIG043_PIO1_24
#undef DMA0_TRIG043_PIO1_25
#undef DMA0_TRIG043_PIO1_26
#undef DMA0_TRIG043_PIO1_27
#undef DMA0_TRIG043_PIO1_28
#undef DMA0_TRIG043_PIO1_29
#undef DMA0_TRIG043_PIO1_30
#undef DMA0_TRIG043_PIO1_31
#undef DMA0_TRIG043_PIO1_4
#undef DMA0_TRIG043_PIO1_5
#undef DMA0_TRIG043_PIO1_6
#undef DMA0_TRIG043_PIO1_7
#undef DMA0_TRIG043_PIO1_8
#undef DMA0_TRIG043_PIO1_9
#undef DMA0_TRIG044_PIO0_12
#undef DMA0_TRIG044_PIO0_23
#undef DMA0_TRIG044_PIO0_28
#undef DMA0_TRIG044_PIO1_10
#undef DMA0_TRIG044_PIO1_12
#undef DMA0_TRIG044_PIO1_14
#undef DMA0_TRIG044_PIO1_17
#undef DMA0_TRIG044_PIO1_18
#undef DMA0_TRIG044_PIO1_19
#undef DMA0_TRIG044_PIO1_20
#undef DMA0_TRIG044_PIO1_21
#undef DMA0_TRIG044_PIO1_23
#undef DMA0_TRIG044_PIO1_24
#undef DMA0_TRIG044_PIO1_25
#undef DMA0_TRIG044_PIO1_26
#undef DMA0_TRIG044_PIO1_27
#undef DMA0_TRIG044_PIO1_28
#undef DMA0_TRIG044_PIO1_29
#undef DMA0_TRIG044_PIO1_30
#undef DMA0_TRIG044_PIO1_31
#undef DMA0_TRIG044_PIO1_4
#undef DMA0_TRIG044_PIO1_5
#undef DMA0_TRIG044_PIO1_6
#undef DMA0_TRIG044_PIO1_7
#undef DMA0_TRIG044_PIO1_8
#undef DMA0_TRIG044_PIO1_9
#undef DMA0_TRIG045_PIO0_12
#undef DMA0_TRIG045_PIO0_23
#undef DMA0_TRIG045_PIO0_28
#undef DMA0_TRIG045_PIO1_10
#undef DMA0_TRIG045_PIO1_12
#undef DMA0_TRIG045_PIO1_14
#undef DMA0_TRIG045_PIO1_17
#undef DMA0_TRIG045_PIO1_18
#undef DMA0_TRIG045_PIO1_19
#undef DMA0_TRIG045_PIO1_20
#undef DMA0_TRIG045_PIO1_21
#undef DMA0_TRIG045_PIO1_23
#undef DMA0_TRIG045_PIO1_24
#undef DMA0_TRIG045_PIO1_25
#undef DMA0_TRIG045_PIO1_26
#undef DMA0_TRIG045_PIO1_27
#undef DMA0_TRIG045_PIO1_28
#undef DMA0_TRIG045_PIO1_29
#undef DMA0_TRIG045_PIO1_30
#undef DMA0_TRIG045_PIO1_31
#undef DMA0_TRIG045_PIO1_4
#undef DMA0_TRIG045_PIO1_5
#undef DMA0_TRIG045_PIO1_6
#undef DMA0_TRIG045_PIO1_7
#undef DMA0_TRIG045_PIO1_8
#undef DMA0_TRIG045_PIO1_9
#undef DMA0_TRIG046_PIO0_12
#undef DMA0_TRIG046_PIO0_23
#undef DMA0_TRIG046_PIO0_28
#undef DMA0_TRIG046_PIO1_10
#undef DMA0_TRIG046_PIO1_12
#undef DMA0_TRIG046_PIO1_14
#undef DMA0_TRIG046_PIO1_17
#undef DMA0_TRIG046_PIO1_18
#undef DMA0_TRIG046_PIO1_19
#undef DMA0_TRIG046_PIO1_20
#undef DMA0_TRIG046_PIO1_21
#undef DMA0_TRIG046_PIO1_23
#undef DMA0_TRIG046_PIO1_24
#undef DMA0_TRIG046_PIO1_25
#undef DMA0_TRIG046_PIO1_26
#undef DMA0_TRIG046_PIO1_27
#undef DMA0_TRIG046_PIO1_28
#undef DMA0_TRIG046_PIO1_29
#undef DMA0_TRIG046_PIO1_30
#undef DMA0_TRIG046_PIO1_31
#undef DMA0_TRIG046_PIO1_4
#undef DMA0_TRIG046_PIO1_5
#undef DMA0_TRIG046_PIO1_6
#undef DMA0_TRIG046_PIO1_7
#undef DMA0_TRIG046_PIO1_8
#undef DMA0_TRIG046_PIO1_9
#undef DMA0_TRIG047_PIO0_12
#undef DMA0_TRIG047_PIO0_23
#undef DMA0_TRIG047_PIO0_28
#undef DMA0_TRIG047_PIO1_10
#undef DMA0_TRIG047_PIO1_12
#undef DMA0_TRIG047_PIO1_14
#undef DMA0_TRIG047_PIO1_17
#undef DMA0_TRIG047_PIO1_18
#undef DMA0_TRIG047_PIO1_19
#undef DMA0_TRIG047_PIO1_20
#undef DMA0_TRIG047_PIO1_21
#undef DMA0_TRIG047_PIO1_23
#undef DMA0_TRIG047_PIO1_24
#undef DMA0_TRIG047_PIO1_25
#undef DMA0_TRIG047_PIO1_26
#undef DMA0_TRIG047_PIO1_27
#undef DMA0_TRIG047_PIO1_28
#undef DMA0_TRIG047_PIO1_29
#undef DMA0_TRIG047_PIO1_30
#undef DMA0_TRIG047_PIO1_31
#undef DMA0_TRIG047_PIO1_4
#undef DMA0_TRIG047_PIO1_5
#undef DMA0_TRIG047_PIO1_6
#undef DMA0_TRIG047_PIO1_7
#undef DMA0_TRIG047_PIO1_8
#undef DMA0_TRIG047_PIO1_9
#undef DMA0_TRIG048_PIO0_12
#undef DMA0_TRIG048_PIO0_23
#undef DMA0_TRIG048_PIO0_28
#undef DMA0_TRIG048_PIO1_10
#undef DMA0_TRIG048_PIO1_12
#undef DMA0_TRIG048_PIO1_14
#undef DMA0_TRIG048_PIO1_17
#undef DMA0_TRIG048_PIO1_18
#undef DMA0_TRIG048_PIO1_19
#undef DMA0_TRIG048_PIO1_20
#undef DMA0_TRIG048_PIO1_21
#undef DMA0_TRIG048_PIO1_23
#undef DMA0_TRIG048_PIO1_24
#undef DMA0_TRIG048_PIO1_25
#undef DMA0_TRIG048_PIO1_26
#undef DMA0_TRIG048_PIO1_27
#undef DMA0_TRIG048_PIO1_28
#undef DMA0_TRIG048_PIO1_29
#undef DMA0_TRIG048_PIO1_30
#undef DMA0_TRIG048_PIO1_31
#undef DMA0_TRIG048_PIO1_4
#undef DMA0_TRIG048_PIO1_5
#undef DMA0_TRIG048_PIO1_6
#undef DMA0_TRIG048_PIO1_7
#undef DMA0_TRIG048_PIO1_8
#undef DMA0_TRIG048_PIO1_9
#undef DMA0_TRIG049_PIO0_12
#undef DMA0_TRIG049_PIO0_23
#undef DMA0_TRIG049_PIO0_28
#undef DMA0_TRIG049_PIO1_10
#undef DMA0_TRIG049_PIO1_12
#undef DMA0_TRIG049_PIO1_14
#undef DMA0_TRIG049_PIO1_17
#undef DMA0_TRIG049_PIO1_18
#undef DMA0_TRIG049_PIO1_19
#undef DMA0_TRIG049_PIO1_20
#undef DMA0_TRIG049_PIO1_21
#undef DMA0_TRIG049_PIO1_23
#undef DMA0_TRIG049_PIO1_24
#undef DMA0_TRIG049_PIO1_25
#undef DMA0_TRIG049_PIO1_26
#undef DMA0_TRIG049_PIO1_27
#undef DMA0_TRIG049_PIO1_28
#undef DMA0_TRIG049_PIO1_29
#undef DMA0_TRIG049_PIO1_30
#undef DMA0_TRIG049_PIO1_31
#undef DMA0_TRIG049_PIO1_4
#undef DMA0_TRIG049_PIO1_5
#undef DMA0_TRIG049_PIO1_6
#undef DMA0_TRIG049_PIO1_7
#undef DMA0_TRIG049_PIO1_8
#undef DMA0_TRIG049_PIO1_9
#undef DMA0_TRIG04_PIO0_12
#undef DMA0_TRIG04_PIO0_23
#undef DMA0_TRIG04_PIO0_28
#undef DMA0_TRIG04_PIO1_10
#undef DMA0_TRIG04_PIO1_12
#undef DMA0_TRIG04_PIO1_14
#undef DMA0_TRIG04_PIO1_17
#undef DMA0_TRIG04_PIO1_18
#undef DMA0_TRIG04_PIO1_19
#undef DMA0_TRIG04_PIO1_20
#undef DMA0_TRIG04_PIO1_21
#undef DMA0_TRIG04_PIO1_23
#undef DMA0_TRIG04_PIO1_24
#undef DMA0_TRIG04_PIO1_25
#undef DMA0_TRIG04_PIO1_26
#undef DMA0_TRIG04_PIO1_27
#undef DMA0_TRIG04_PIO1_28
#undef DMA0_TRIG04_PIO1_29
#undef DMA0_TRIG04_PIO1_30
#undef DMA0_TRIG04_PIO1_31
#undef DMA0_TRIG04_PIO1_4
#undef DMA0_TRIG04_PIO1_5
#undef DMA0_TRIG04_PIO1_6
#undef DMA0_TRIG04_PIO1_7
#undef DMA0_TRIG04_PIO1_8
#undef DMA0_TRIG04_PIO1_9
#undef DMA0_TRIG050_PIO0_12
#undef DMA0_TRIG050_PIO0_23
#undef DMA0_TRIG050_PIO0_28
#undef DMA0_TRIG050_PIO1_10
#undef DMA0_TRIG050_PIO1_12
#undef DMA0_TRIG050_PIO1_14
#undef DMA0_TRIG050_PIO1_17
#undef DMA0_TRIG050_PIO1_18
#undef DMA0_TRIG050_PIO1_19
#undef DMA0_TRIG050_PIO1_20
#undef DMA0_TRIG050_PIO1_21
#undef DMA0_TRIG050_PIO1_23
#undef DMA0_TRIG050_PIO1_24
#undef DMA0_TRIG050_PIO1_25
#undef DMA0_TRIG050_PIO1_26
#undef DMA0_TRIG050_PIO1_27
#undef DMA0_TRIG050_PIO1_28
#undef DMA0_TRIG050_PIO1_29
#undef DMA0_TRIG050_PIO1_30
#undef DMA0_TRIG050_PIO1_31
#undef DMA0_TRIG050_PIO1_4
#undef DMA0_TRIG050_PIO1_5
#undef DMA0_TRIG050_PIO1_6
#undef DMA0_TRIG050_PIO1_7
#undef DMA0_TRIG050_PIO1_8
#undef DMA0_TRIG050_PIO1_9
#undef DMA0_TRIG051_PIO0_12
#undef DMA0_TRIG051_PIO0_23
#undef DMA0_TRIG051_PIO0_28
#undef DMA0_TRIG051_PIO1_10
#undef DMA0_TRIG051_PIO1_12
#undef DMA0_TRIG051_PIO1_14
#undef DMA0_TRIG051_PIO1_17
#undef DMA0_TRIG051_PIO1_18
#undef DMA0_TRIG051_PIO1_19
#undef DMA0_TRIG051_PIO1_20
#undef DMA0_TRIG051_PIO1_21
#undef DMA0_TRIG051_PIO1_23
#undef DMA0_TRIG051_PIO1_24
#undef DMA0_TRIG051_PIO1_25
#undef DMA0_TRIG051_PIO1_26
#undef DMA0_TRIG051_PIO1_27
#undef DMA0_TRIG051_PIO1_28
#undef DMA0_TRIG051_PIO1_29
#undef DMA0_TRIG051_PIO1_30
#undef DMA0_TRIG051_PIO1_31
#undef DMA0_TRIG051_PIO1_4
#undef DMA0_TRIG051_PIO1_5
#undef DMA0_TRIG051_PIO1_6
#undef DMA0_TRIG051_PIO1_7
#undef DMA0_TRIG051_PIO1_8
#undef DMA0_TRIG051_PIO1_9
#undef DMA0_TRIG05_PIO0_12
#undef DMA0_TRIG05_PIO0_23
#undef DMA0_TRIG05_PIO0_28
#undef DMA0_TRIG05_PIO1_10
#undef DMA0_TRIG05_PIO1_12
#undef DMA0_TRIG05_PIO1_14
#undef DMA0_TRIG05_PIO1_17
#undef DMA0_TRIG05_PIO1_18
#undef DMA0_TRIG05_PIO1_19
#undef DMA0_TRIG05_PIO1_20
#undef DMA0_TRIG05_PIO1_21
#undef DMA0_TRIG05_PIO1_23
#undef DMA0_TRIG05_PIO1_24
#undef DMA0_TRIG05_PIO1_25
#undef DMA0_TRIG05_PIO1_26
#undef DMA0_TRIG05_PIO1_27
#undef DMA0_TRIG05_PIO1_28
#undef DMA0_TRIG05_PIO1_29
#undef DMA0_TRIG05_PIO1_30
#undef DMA0_TRIG05_PIO1_31
#undef DMA0_TRIG05_PIO1_4
#undef DMA0_TRIG05_PIO1_5
#undef DMA0_TRIG05_PIO1_6
#undef DMA0_TRIG05_PIO1_7
#undef DMA0_TRIG05_PIO1_8
#undef DMA0_TRIG05_PIO1_9
#undef DMA0_TRIG06_PIO0_12
#undef DMA0_TRIG06_PIO0_23
#undef DMA0_TRIG06_PIO0_28
#undef DMA0_TRIG06_PIO1_10
#undef DMA0_TRIG06_PIO1_12
#undef DMA0_TRIG06_PIO1_14
#undef DMA0_TRIG06_PIO1_17
#undef DMA0_TRIG06_PIO1_18
#undef DMA0_TRIG06_PIO1_19
#undef DMA0_TRIG06_PIO1_20
#undef DMA0_TRIG06_PIO1_21
#undef DMA0_TRIG06_PIO1_23
#undef DMA0_TRIG06_PIO1_24
#undef DMA0_TRIG06_PIO1_25
#undef DMA0_TRIG06_PIO1_26
#undef DMA0_TRIG06_PIO1_27
#undef DMA0_TRIG06_PIO1_28
#undef DMA0_TRIG06_PIO1_29
#undef DMA0_TRIG06_PIO1_30
#undef DMA0_TRIG06_PIO1_31
#undef DMA0_TRIG06_PIO1_4
#undef DMA0_TRIG06_PIO1_5
#undef DMA0_TRIG06_PIO1_6
#undef DMA0_TRIG06_PIO1_7
#undef DMA0_TRIG06_PIO1_8
#undef DMA0_TRIG06_PIO1_9
#undef DMA0_TRIG07_PIO0_12
#undef DMA0_TRIG07_PIO0_23
#undef DMA0_TRIG07_PIO0_28
#undef DMA0_TRIG07_PIO1_10
#undef DMA0_TRIG07_PIO1_12
#undef DMA0_TRIG07_PIO1_14
#undef DMA0_TRIG07_PIO1_17
#undef DMA0_TRIG07_PIO1_18
#undef DMA0_TRIG07_PIO1_19
#undef DMA0_TRIG07_PIO1_20
#undef DMA0_TRIG07_PIO1_21
#undef DMA0_TRIG07_PIO1_23
#undef DMA0_TRIG07_PIO1_24
#undef DMA0_TRIG07_PIO1_25
#undef DMA0_TRIG07_PIO1_26
#undef DMA0_TRIG07_PIO1_27
#undef DMA0_TRIG07_PIO1_28
#undef DMA0_TRIG07_PIO1_29
#undef DMA0_TRIG07_PIO1_30
#undef DMA0_TRIG07_PIO1_31
#undef DMA0_TRIG07_PIO1_4
#undef DMA0_TRIG07_PIO1_5
#undef DMA0_TRIG07_PIO1_6
#undef DMA0_TRIG07_PIO1_7
